rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_LPSPI.h
/*
** ###################################################################
**     Processor:           S32M24x
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32M24x RM Rev.4
**     Version:             rev. 1.5, 2024-08-01
**     Build:               b240801
**
**     Abstract:
**         Peripheral Access Layer for S32M24x
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32M24x_LPSPI.h
 * @version 1.5
 * @date 2024-08-01
 * @brief Peripheral Access Layer for S32M24x_LPSPI
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
 * The SoC header defines typedef for all modules.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
 * The SoC header defines macros for all modules and registers.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
 * These are generated macros used for accessing the bit-fields from registers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.1, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.2, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.4, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.5, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
 * This type qualifier is needed to ensure correct I/O access and addressing.
 */

/* Prevention from multiple including the same memory map */
#if !defined(S32M24x_LPSPI_H_) /* Check if memory map has not been already included */
#define S32M24x_LPSPI_H_

#include "S32M24x_COMMON.h"

/* ----------------------------------------------------------------------------
   -- LPSPI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPSPI_Peripheral_Access_Layer LPSPI Peripheral Access Layer
 * @{
 */

/** LPSPI - Register Layout Typedef */
typedef struct {
    __I uint32_t VERID; /**< Version ID Register, offset: 0x0 */
    __I uint32_t PARAM; /**< Parameter Register, offset: 0x4 */
    uint8_t RESERVED_0[8];
    __IO uint32_t CR;    /**< Control Register, offset: 0x10 */
    __IO uint32_t SR;    /**< Status Register, offset: 0x14 */
    __IO uint32_t IER;   /**< Interrupt Enable Register, offset: 0x18 */
    __IO uint32_t DER;   /**< DMA Enable Register, offset: 0x1C */
    __IO uint32_t CFGR0; /**< Configuration Register 0, offset: 0x20 */
    __IO uint32_t CFGR1; /**< Configuration Register 1, offset: 0x24 */
    uint8_t RESERVED_1[8];
    __IO uint32_t DMR0; /**< Data Match Register 0, offset: 0x30 */
    __IO uint32_t DMR1; /**< Data Match Register 1, offset: 0x34 */
    uint8_t RESERVED_2[8];
    __IO uint32_t CCR; /**< Clock Configuration Register, offset: 0x40 */
    uint8_t RESERVED_3[20];
    __IO uint32_t FCR; /**< The FIFO Control register contains the RXWATER and TXWATER control
                          fields., offset: 0x58 */
    __I uint32_t FSR;  /**< FIFO Status Register, offset: 0x5C */
    __IO uint32_t TCR; /**< Transmit Command Register, offset: 0x60 */
    __O uint32_t TDR;  /**< Transmit Data Register, offset: 0x64 */
    uint8_t RESERVED_4[8];
    __I uint32_t RSR; /**< Receive Status Register, offset: 0x70 */
    __I uint32_t RDR; /**< Receive Data Register, offset: 0x74 */
} LPSPI_Type, *LPSPI_MemMapPtr;

/** Number of instances of the LPSPI module. */
#define LPSPI_INSTANCE_COUNT (3u)

/* LPSPI - Peripheral instance base addresses */
/** Peripheral LPSPI0 base address */
#define IP_LPSPI0_BASE (0x4002C000u)
/** Peripheral LPSPI0 base pointer */
#define IP_LPSPI0 ((LPSPI_Type*)IP_LPSPI0_BASE)
/** Peripheral LPSPI1 base address */
#define IP_LPSPI1_BASE (0x4002D000u)
/** Peripheral LPSPI1 base pointer */
#define IP_LPSPI1 ((LPSPI_Type*)IP_LPSPI1_BASE)
/** Peripheral LPSPI2 base address */
#define IP_LPSPI2_BASE (0x4002E000u)
/** Peripheral LPSPI2 base pointer */
#define IP_LPSPI2 ((LPSPI_Type*)IP_LPSPI2_BASE)
/** Array initializer of LPSPI peripheral base addresses */
#define IP_LPSPI_BASE_ADDRS                                                                        \
    {                                                                                              \
        IP_LPSPI0_BASE, IP_LPSPI1_BASE, IP_LPSPI2_BASE                                             \
    }
/** Array initializer of LPSPI peripheral base pointers */
#define IP_LPSPI_BASE_PTRS                                                                         \
    {                                                                                              \
        IP_LPSPI0, IP_LPSPI1, IP_LPSPI2                                                            \
    }

/* ----------------------------------------------------------------------------
   -- LPSPI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPSPI_Register_Masks LPSPI Register Masks
 * @{
 */

